pecostm32/STM32F303_Sine_Square_Generator/STM32F3_Sine_Square_Gen/stm32f303_db.h
#ifndef __STM32F303_H_
#define __STM32F303_H_

#include <stdint.h>

#define     __IO    volatile

#define     __IM     volatile const      //Defines 'read only' structure member permissions
#define     __OM     volatile            //Defines 'write only' structure member permissions
#define     __IOM    volatile            //Defines 'read / write' structure member permissions

//Power Control
typedef struct
{
  __IO uint32_t CR;
  __IO uint32_t CSR;
} PWR_TypeDef;


//Reset and Clock Control
typedef struct
{
  __IO uint32_t CR;
  __IO uint32_t CFGR;
  __IO uint32_t CIR;
  __IO uint32_t APB2RSTR;
  __IO uint32_t APB1RSTR;
  __IO uint32_t AHBENR;
  __IO uint32_t APB2ENR;
  __IO uint32_t APB1ENR;
  __IO uint32_t BDCR;
  __IO uint32_t CSR;
  __IO uint32_t AHBRSTR;
  __IO uint32_t CFGR2;
  __IO uint32_t CFGR3;
} RCC_TypeDef;

//FLASH Registers
typedef struct
{
  __IO uint32_t ACR;
  __IO uint32_t KEYR;
  __IO uint32_t OPTKEYR;
  __IO uint32_t SR;
  __IO uint32_t CR;
  __IO uint32_t AR;
  __IO uint32_t RESERVED;
  __IO uint32_t OBR;
  __IO uint32_t WRPR;
} FLASH_TypeDef;

//Real-Time Clock
typedef struct
{
  __IO uint32_t TR;
  __IO uint32_t DR;
  __IO uint32_t CR;
  __IO uint32_t ISR;
  __IO uint32_t PRER;
  __IO uint32_t WUTR;
       uint32_t RESERVED0;
  __IO uint32_t ALRMAR;
  __IO uint32_t ALRMBR;
  __IO uint32_t WPR;
  __IO uint32_t SSR;
  __IO uint32_t SHIFTR;
  __IO uint32_t TSTR;
  __IO uint32_t TSDR;
  __IO uint32_t TSSSR;
  __IO uint32_t CALR;
  __IO uint32_t TAFCR;
  __IO uint32_t ALRMASSR;
  __IO uint32_t ALRMBSSR;
       uint32_t RESERVED7;
  __IO uint32_t BKP0R;
  __IO uint32_t BKP1R;
  __IO uint32_t BKP2R;
  __IO uint32_t BKP3R;
  __IO uint32_t BKP4R;
  __IO uint32_t BKP5R;
  __IO uint32_t BKP6R;
  __IO uint32_t BKP7R;
  __IO uint32_t BKP8R;
  __IO uint32_t BKP9R;
  __IO uint32_t BKP10R;
  __IO uint32_t BKP11R;
  __IO uint32_t BKP12R;
  __IO uint32_t BKP13R;
  __IO uint32_t BKP14R;
  __IO uint32_t BKP15R;
} RTC_TypeDef;

//General Purpose I/O
typedef struct
{
  __IO uint32_t MODER;        //GPIO port mode register,               Address offset: 0x00
  __IO uint32_t OTYPER;       //GPIO port output type register,        Address offset: 0x04
  __IO uint32_t OSPEEDR;      //GPIO port output speed register,       Address offset: 0x08
  __IO uint32_t PUPDR;        //GPIO port pull-up/pull-down register,  Address offset: 0x0C
  __IO uint32_t IDR;          //GPIO port input data register,         Address offset: 0x10
  __IO uint32_t ODR;          //GPIO port output data register,        Address offset: 0x14
  __IO uint32_t BSRR;         //GPIO port bit set/reset register,      Address offset: 0x1A
  __IO uint32_t LCKR;         //GPIO port configuration lock register, Address offset: 0x1C
  __IO uint32_t AFR[2];       //GPIO alternate function registers,     Address offset: 0x20-0x24
  __IO uint32_t BRR;          //GPIO bit reset register,               Address offset: 0x28
} GPIO_TypeDef;

//TIM Timers
typedef struct
{
  __IO uint32_t CR1;             //TIM control register 1,                      Address offset: 0x00
  __IO uint32_t CR2;             //TIM control register 2,                      Address offset: 0x04
  __IO uint32_t SMCR;            //TIM slave Mode Control register,             Address offset: 0x08
  __IO uint32_t DIER;            //TIM DMA/interrupt enable register,           Address offset: 0x0C
  __IO uint32_t SR;              //TIM status register,                         Address offset: 0x10
  __IO uint32_t EGR;             //TIM event generation register,               Address offset: 0x14
  __IO uint32_t CCMR1;           //TIM  capture/compare mode register 1,        Address offset: 0x18
  __IO uint32_t CCMR2;           //TIM  capture/compare mode register 2,        Address offset: 0x1C
  __IO uint32_t CCER;            //TIM capture/compare enable register,         Address offset: 0x20
  __IO uint32_t CNT;             //TIM counter register,                        Address offset: 0x24
  __IO uint32_t PSC;             //TIM prescaler register,                      Address offset: 0x28
  __IO uint32_t ARR;             //TIM auto-reload register,                    Address offset: 0x2C
  __IO uint32_t RCR;             //TIM  repetition counter register,            Address offset: 0x30
  __IO uint32_t CCR1;            //TIM capture/compare register 1,              Address offset: 0x34
  __IO uint32_t CCR2;            //TIM capture/compare register 2,              Address offset: 0x38
  __IO uint32_t CCR3;            //TIM capture/compare register 3,              Address offset: 0x3C
  __IO uint32_t CCR4;            //TIM capture/compare register 4,              Address offset: 0x40
  __IO uint32_t BDTR;            //TIM break and dead-time register,            Address offset: 0x44
  __IO uint32_t DCR;             //TIM DMA control register,                    Address offset: 0x48
  __IO uint32_t DMAR;            //TIM DMA address for full transfer register,  Address offset: 0x4C
  __IO uint32_t OR;              //TIM option register,                         Address offset: 0x50
  __IO uint32_t CCMR3;           //TIM capture/compare mode register 3,         Address offset: 0x54
  __IO uint32_t CCR5;            //TIM capture/compare register5,               Address offset: 0x58
  __IO uint32_t CCR6;            //TIM capture/compare register 4,              Address offset: 0x5C
}TIM_TypeDef;

//External Interrupt/Event Controller
typedef struct
{
  __IO uint32_t IMR;
  __IO uint32_t EMR;
  __IO uint32_t RTSR;
  __IO uint32_t FTSR;
  __IO uint32_t SWIER;
  __IO uint32_t PR;
       uint32_t RESERVED1;
       uint32_t RESERVED2;
  __IO uint32_t IMR2;
  __IO uint32_t EMR2;
  __IO uint32_t RTSR2;
  __IO uint32_t FTSR2;
  __IO uint32_t SWIER2;
  __IO uint32_t PR2;
} EXTI_TypeDef;

//Structure type to access the System Control Block (SCB).
typedef struct
{
  __IM  uint32_t CPUID;                  //Offset: 0x000 (R/ )  CPUID Base Register
  __IOM uint32_t ICSR;                   //Offset: 0x004 (R/W)  Interrupt Control and State Register
  __IOM uint32_t VTOR;                   //Offset: 0x008 (R/W)  Vector Table Offset Register
  __IOM uint32_t AIRCR;                  //Offset: 0x00C (R/W)  Application Interrupt and Reset Control Register
  __IOM uint32_t SCR;                    //Offset: 0x010 (R/W)  System Control Register
  __IOM uint32_t CCR;                    //Offset: 0x014 (R/W)  Configuration Control Register
  __IOM uint8_t  SHP[12U];               //Offset: 0x018 (R/W)  System Handlers Priority Registers (4-7, 8-11, 12-15)
  __IOM uint32_t SHCSR;                  //Offset: 0x024 (R/W)  System Handler Control and State Register
  __IOM uint32_t CFSR;                   //Offset: 0x028 (R/W)  Configurable Fault Status Register
  __IOM uint32_t HFSR;                   //Offset: 0x02C (R/W)  HardFault Status Register
  __IOM uint32_t DFSR;                   //Offset: 0x030 (R/W)  Debug Fault Status Register
  __IOM uint32_t MMFAR;                  //Offset: 0x034 (R/W)  MemManage Fault Address Register
  __IOM uint32_t BFAR;                   //Offset: 0x038 (R/W)  BusFault Address Register
  __IOM uint32_t AFSR;                   //Offset: 0x03C (R/W)  Auxiliary Fault Status Register
  __IM  uint32_t PFR[2U];                //Offset: 0x040 (R/ )  Processor Feature Register
  __IM  uint32_t DFR;                    //Offset: 0x048 (R/ )  Debug Feature Register
  __IM  uint32_t ADR;                    //Offset: 0x04C (R/ )  Auxiliary Feature Register
  __IM  uint32_t MMFR[4U];               //Offset: 0x050 (R/ )  Memory Model Feature Register
  __IM  uint32_t ISAR[5U];               //Offset: 0x060 (R/ )  Instruction Set Attributes Register
        uint32_t RESERVED0[5U];
  __IOM uint32_t CPACR;                  //Offset: 0x088 (R/W)  Coprocessor Access Control Register
} SCB_Type;

//Structure type to access the Nested Vectored Interrupt Controller (NVIC)
typedef struct
{
  __IOM uint32_t ISER[8U];               //Offset: 0x000 (R/W)  Interrupt Set Enable Register
        uint32_t RESERVED0[24U];
  __IOM uint32_t ICER[8U];               //Offset: 0x080 (R/W)  Interrupt Clear Enable Register
        uint32_t RSERVED1[24U];
  __IOM uint32_t ISPR[8U];               //Offset: 0x100 (R/W)  Interrupt Set Pending Register
        uint32_t RESERVED2[24U];
  __IOM uint32_t ICPR[8U];               //Offset: 0x180 (R/W)  Interrupt Clear Pending Register
        uint32_t RESERVED3[24U];
  __IOM uint32_t IABR[8U];               //Offset: 0x200 (R/W)  Interrupt Active bit Register
        uint32_t RESERVED4[56U];
  __IOM uint8_t  IP[240U];               //Offset: 0x300 (R/W)  Interrupt Priority Register (8Bit wide)
        uint32_t RESERVED5[644U];
  __OM  uint32_t STIR;                   //Offset: 0xE00 ( /W)  Software Trigger Interrupt Register
}  NVIC_Type;

//Structure typedef to access the System Tick Timer
typedef struct
{
  __IOM uint32_t CTRL;                   //Offset: 0x000 (R/W)  SysTick Control and Status Register
  __IOM uint32_t LOAD;                   //Offset: 0x004 (R/W)  SysTick Reload Value Register
  __IOM uint32_t VAL;                    //Offset: 0x008 (R/W)  SysTick Current Value Register
  __IM  uint32_t CALIB;                  //Offset: 0x00C (R/ )  SysTick Calibration Register
} STK_Type;

//DMA channel
typedef struct
{
  __IO uint32_t CCR;          //DMA channel x configuration register            
  __IO uint32_t CNDTR;        //DMA channel x number of data register           
  __IO uint32_t CPAR;         //DMA channel x peripheral address register       
  __IO uint32_t CMAR;         //DMA channel x memory address register           
} DMA_Channel_TypeDef;

//DMA
typedef struct
{
  __IO uint32_t ISR;          //DMA interrupt status register,                            Address offset: 0x00
  __IO uint32_t IFCR;         //DMA interrupt flag clear register,                        Address offset: 0x04
} DMA_TypeDef;

//Digital to Analog Converter
typedef struct
{
  __IO uint32_t CR;       //DAC control register,                                    Address offset: 0x00
  __IO uint32_t SWTRIGR;  //DAC software trigger register,                           Address offset: 0x04
  __IO uint32_t DHR12R1;  //DAC channel1 12-bit right-aligned data holding register, Address offset: 0x08
  __IO uint32_t DHR12L1;  //DAC channel1 12-bit left aligned data holding register,  Address offset: 0x0C
  __IO uint32_t DHR8R1;   //DAC channel1 8-bit right aligned data holding register,  Address offset: 0x10
  __IO uint32_t DHR12R2;  //DAC channel2 12-bit right aligned data holding register, Address offset: 0x14
  __IO uint32_t DHR12L2;  //DAC channel2 12-bit left aligned data holding register,  Address offset: 0x18
  __IO uint32_t DHR8R2;   //DAC channel2 8-bit right-aligned data holding register,  Address offset: 0x1C
  __IO uint32_t DHR12RD;  //Dual DAC 12-bit right-aligned data holding register,     Address offset: 0x20
  __IO uint32_t DHR12LD;  //DUAL DAC 12-bit left aligned data holding register,      Address offset: 0x24
  __IO uint32_t DHR8RD;   //DUAL DAC 8-bit right aligned data holding register,      Address offset: 0x28
  __IO uint32_t DOR1;     //DAC channel1 data output register,                       Address offset: 0x2C
  __IO uint32_t DOR2;     //DAC channel2 data output register,                       Address offset: 0x30
  __IO uint32_t SR;       //DAC status register,                                     Address offset: 0x34
} DAC_TypeDef;

