pecostm32/STM32F303_Sine_Square_Generator/STM32F3_Sine_Square_Gen/stm32f303_db.h
//Analog to digital converter
typedef struct
{
  __IO uint32_t ISR;              //ADC Interrupt and Status Register,                 Address offset: 0x00
  __IO uint32_t IER;              //ADC Interrupt Enable Register,                     Address offset: 0x04
  __IO uint32_t CR;               //ADC control register,                              Address offset: 0x08
  __IO uint32_t CFGR;             //ADC Configuration register,                        Address offset: 0x0C
  uint32_t      RESERVED0;        //Reserved, 0x010                                                        
  __IO uint32_t SMPR1;            //ADC sample time register 1,                        Address offset: 0x14
  __IO uint32_t SMPR2;            //ADC sample time register 2,                        Address offset: 0x18
  uint32_t      RESERVED1;        //Reserved, 0x01C                                                        
  __IO uint32_t TR1;              //ADC watchdog threshold register 1,                 Address offset: 0x20
  __IO uint32_t TR2;              //ADC watchdog threshold register 2,                 Address offset: 0x24
  __IO uint32_t TR3;              //ADC watchdog threshold register 3,                 Address offset: 0x28
  uint32_t      RESERVED2;        //Reserved, 0x02C                                                        
  __IO uint32_t SQR1;             //ADC regular sequence register 1,                   Address offset: 0x30
  __IO uint32_t SQR2;             //ADC regular sequence register 2,                   Address offset: 0x34
  __IO uint32_t SQR3;             //ADC regular sequence register 3,                   Address offset: 0x38
  __IO uint32_t SQR4;             //ADC regular sequence register 4,                   Address offset: 0x3C
  __IO uint32_t DR;               //ADC regular data register,                         Address offset: 0x40
  uint32_t      RESERVED3;        //Reserved, 0x044                                                        
  uint32_t      RESERVED4;        //Reserved, 0x048                                                        
  __IO uint32_t JSQR;             //ADC injected sequence register,                    Address offset: 0x4C
  uint32_t      RESERVED5[4];     //Reserved, 0x050 - 0x05C                                                
  __IO uint32_t OFR1;             //ADC offset register 1,                             Address offset: 0x60
  __IO uint32_t OFR2;             //ADC offset register 2,                             Address offset: 0x64
  __IO uint32_t OFR3;             //ADC offset register 3,                             Address offset: 0x68
  __IO uint32_t OFR4;             //ADC offset register 4,                             Address offset: 0x6C
  uint32_t      RESERVED6[4];     //Reserved, 0x070 - 0x07C                                                
  __IO uint32_t JDR1;             //ADC injected data register 1,                      Address offset: 0x80
  __IO uint32_t JDR2;             //ADC injected data register 2,                      Address offset: 0x84
  __IO uint32_t JDR3;             //ADC injected data register 3,                      Address offset: 0x88
  __IO uint32_t JDR4;             //ADC injected data register 4,                      Address offset: 0x8C
  uint32_t      RESERVED7[4];     //Reserved, 0x090 - 0x09C                                                
  __IO uint32_t AWD2CR;           //ADC  Analog Watchdog 2 Configuration Register,     Address offset: 0xA0
  __IO uint32_t AWD3CR;           //ADC  Analog Watchdog 3 Configuration Register,     Address offset: 0xA4
  uint32_t      RESERVED8;        //Reserved, 0x0A8                                                        
  uint32_t      RESERVED9;        //Reserved, 0x0AC                                                        
  __IO uint32_t DIFSEL;           //ADC  Differential Mode Selection Register,         Address offset: 0xB0
  __IO uint32_t CALFACT;          //ADC  Calibration Factors,                          Address offset: 0xB4
} ADC_TypeDef;

//Common registers of an ADC pair
typedef struct
{
  __IO uint32_t CSR;              //ADC Common status register,                                  Address offset: ADC1/3 base address + 0x300
  uint32_t      RESERVED;         //Reserved,                                                    Address offset: ADC1/3 base address + 0x304                                                   
  __IO uint32_t CCR;              //ADC common control register,                                 Address offset: ADC1/3 base address + 0x308
  __IO uint32_t CDR;              //ADC common regular data register for dual and triple modes,  Address offset: ADC1/3 base address + 0x30C
} ADC_Common_TypeDef;

//Universal Serial Bus Full Speed Device
typedef struct
{
  __IO uint16_t EP0R;                 //USB Endpoint 0 register,         Address offset: 0x00
  __IO uint16_t RESERVED0;            //Reserved
  __IO uint16_t EP1R;                 //USB Endpoint 1 register,         Address offset: 0x04
  __IO uint16_t RESERVED1;            //Reserved
  __IO uint16_t EP2R;                 //USB Endpoint 2 register,         Address offset: 0x08
  __IO uint16_t RESERVED2;            //Reserved
  __IO uint16_t EP3R;                 //USB Endpoint 3 register,         Address offset: 0x0C
  __IO uint16_t RESERVED3;            //Reserved
  __IO uint16_t EP4R;                 //USB Endpoint 4 register,         Address offset: 0x10
  __IO uint16_t RESERVED4;            //Reserved
  __IO uint16_t EP5R;                 //USB Endpoint 5 register,         Address offset: 0x14
  __IO uint16_t RESERVED5;            //Reserved
  __IO uint16_t EP6R;                 //USB Endpoint 6 register,         Address offset: 0x18
  __IO uint16_t RESERVED6;            //Reserved
  __IO uint16_t EP7R;                 //USB Endpoint 7 register,         Address offset: 0x1C
  __IO uint16_t RESERVED7[17];        //Reserved
  __IO uint16_t CNTR;                 //Control register,                Address offset: 0x40
  __IO uint16_t RESERVED8;            //Reserved
  __IO uint16_t ISTR;                 //Interrupt status register,       Address offset: 0x44
  __IO uint16_t RESERVED9;            //Reserved
  __IO uint16_t FNR;                  //Frame number register,           Address offset: 0x48
  __IO uint16_t RESERVEDA;            //Reserved
  __IO uint16_t DADDR;                //Device address register,         Address offset: 0x4C
  __IO uint16_t RESERVEDB;            //Reserved
  __IO uint16_t BTABLE;               //Buffer Table address register,   Address offset: 0x50
  __IO uint16_t RESERVEDC;            //Reserved
} USB_TypeDef;

