pecostm32/STM32F303_Sine_Square_Generator/STM32F3_Sine_Square_Gen/stm32f303_db.h
//Packet memory entry
typedef struct
{
  __IO uint16_t DATA;
       uint16_t RESERVED;
}PMA_ENTRY;

//Structure for PMA
typedef struct
{
  PMA_ENTRY MEMORY[256];
} PMA_TypeDef;

//Structure for Buffer Descriptor Table
typedef struct
{
  PMA_ENTRY TX_ADDRESS;
  PMA_ENTRY TX_COUNT;
  PMA_ENTRY RX_ADDRESS;
  PMA_ENTRY RX_COUNT;
} BTABLE_ENTRY;

//Structure for endpoint descriptors
typedef struct
{
  BTABLE_ENTRY EPD[8];
} BTABLE_TypeDef;

typedef union
{
  uint16_t word;
  struct BYTES
  {
    uint8_t low;
    uint8_t high;
  } bytes;
} wbcombi;


#define PMA_BASE    (0x40006000L)  //USB_IP Packet Memory Area base address

#define PMA         ((PMA_TypeDef *) PMA_BASE)
#define EPBTABLE    ((BTABLE_TypeDef *) PMA_BASE)


#define RCC_BASE    0x40021000
#define PWR_BASE    0x40007000
#define RTC_BASE    0x40002800
#define EXTI_BASE   0x40010400

#define USB_BASE    0x40005C00

#define GPIOA_BASE  0x48000000
#define GPIOB_BASE  0x48000400
#define GPIOC_BASE  0x48000800

#define DMA1_BASE             0x40020000
#define DMA1_Channel1_BASE    0x40020008
#define DMA1_Channel2_BASE    0x4002001C
#define DMA1_Channel3_BASE    0x40020030
#define DMA1_Channel4_BASE    0x40020044
#define DMA1_Channel5_BASE    0x40020058
#define DMA1_Channel6_BASE    0x4002006C
#define DMA1_Channel7_BASE    0x40020080
#define DMA2_BASE             0x40020400
#define DMA2_Channel1_BASE    0x40020408
#define DMA2_Channel2_BASE    0x4002041C
#define DMA2_Channel3_BASE    0x40020430
#define DMA2_Channel4_BASE    0x40020444
#define DMA2_Channel5_BASE    0x40020458

#define ADC1_BASE              0x50000000
#define ADC2_BASE              0x50000100
#define ADC1_2_COMMON_BASE     0x50000300
#define ADC3_BASE              0x50000400
#define ADC4_BASE              0x50000500
#define ADC3_4_COMMON_BASE     0x50000700

#define DAC1_BASE   0x40007400

#define TIM1_BASE   0x40012C00

#define TIM2_BASE   0x40000000
#define TIM3_BASE   0x40000400
#define TIM4_BASE   0x40000800

#define USART_BASE  0x40013800

#define NVIC_BASE   0xE000E100
#define SCB_BASE    0xE000ED00
#define STK_BASE    0xE000E010

#define FLASH_BASE  0x40022000

#define FLASH_START 0x08000000





#define GPIOA               ((GPIO_TypeDef *)GPIOA_BASE)
#define GPIOB               ((GPIO_TypeDef *)GPIOB_BASE)
#define GPIOC               ((GPIO_TypeDef *)GPIOC_BASE)

#define TIM1                ((TIM_TypeDef *)TIM1_BASE)
#define TIM2                ((TIM_TypeDef *)TIM2_BASE)
#define TIM3                ((TIM_TypeDef *)TIM3_BASE)
#define TIM4                ((TIM_TypeDef *)TIM4_BASE)

#define DMA1                ((DMA_TypeDef *) DMA1_BASE)
#define DMA1_Channel1       ((DMA_Channel_TypeDef *) DMA1_Channel1_BASE)
#define DMA1_Channel2       ((DMA_Channel_TypeDef *) DMA1_Channel2_BASE)
#define DMA1_Channel3       ((DMA_Channel_TypeDef *) DMA1_Channel3_BASE)
#define DMA1_Channel4       ((DMA_Channel_TypeDef *) DMA1_Channel4_BASE)
#define DMA1_Channel5       ((DMA_Channel_TypeDef *) DMA1_Channel5_BASE)
#define DMA1_Channel6       ((DMA_Channel_TypeDef *) DMA1_Channel6_BASE)
#define DMA1_Channel7       ((DMA_Channel_TypeDef *) DMA1_Channel7_BASE)
#define DMA2                ((DMA_TypeDef *) DMA2_BASE)
#define DMA2_Channel1       ((DMA_Channel_TypeDef *) DMA2_Channel1_BASE)
#define DMA2_Channel2       ((DMA_Channel_TypeDef *) DMA2_Channel2_BASE)
#define DMA2_Channel3       ((DMA_Channel_TypeDef *) DMA2_Channel3_BASE)
#define DMA2_Channel4       ((DMA_Channel_TypeDef *) DMA2_Channel4_BASE)
#define DMA2_Channel5       ((DMA_Channel_TypeDef *) DMA2_Channel5_BASE)

#define DAC1                ((DAC_TypeDef *)DAC1_BASE)

#define ADC1                ((ADC_TypeDef *) ADC1_BASE)
#define ADC2                ((ADC_TypeDef *) ADC2_BASE)
#define ADC3                ((ADC_TypeDef *) ADC3_BASE)
#define ADC4                ((ADC_TypeDef *) ADC4_BASE)
#define ADC12_COMMON        ((ADC_Common_TypeDef *) ADC1_2_COMMON_BASE)
#define ADC34_COMMON        ((ADC_Common_TypeDef *) ADC3_4_COMMON_BASE)

#define PWR                 ((PWR_TypeDef *)PWR_BASE)
#define RCC                 ((RCC_TypeDef *)RCC_BASE)
#define USB                 ((USB_TypeDef *)USB_BASE)
#define FLASH               ((FLASH_TypeDef *)FLASH_BASE)
#define RTC                 ((RTC_TypeDef *)RTC_BASE)
#define EXTI                ((EXTI_TypeDef *)EXTI_BASE)
#define SCB                 ((SCB_Type *)SCB_BASE)
#define NVIC                ((NVIC_Type *)NVIC_BASE)
#define STK                 ((STK_Type *)STK_BASE)


#define DMA1_CH3_IRQn         13
#define USB_LP_CAN1_RX0_IRQn  20
#define TIM1_UP_IRQn          25
#define TIM2_IRQn             28
#define TIM3_IRQn             29


#define FLASH_ACR_LATENCY_2   0x00000004
#define FLASH_ACR_PRFTBE      0x00000010               //Prefetch Buffer Enable

#define RCC_CFGR_PLLMULL9     0x001C0000               //PLL input clock*9
#define RCC_CFGR_PLLSRC       0x00010000               //PLL entry clock source
#define RCC_CFGR_PPRE1_DIV2   0x00000400               //HCLK divided by 2
#define RCC_CFGR_PPRE2_DIV2   0x00002000               //HCLK divided by 2

#define RCC_CR_HSEON          0x00010000               //External High Speed clock enable
#define RCC_CR_HSERDY         0x00020000               //External High Speed clock ready flag

#define RCC_CR_PLLON          0x01000000               //PLL enable
#define RCC_CR_PLLRDY         0x02000000               //PLL clock ready flag

#define RCC_CFGR_SW_PLL       0x00000002               //PLL selected as system clock
#define RCC_CFGR_SWS_PLL      0x00000008               //PLL used as system clock

// Bit definition for RCC_AHBENR register
#define RCC_AHBENR_DMA1EN                        0x00000001         //DMA1 clock enable
#define RCC_AHBENR_DMA2EN                        0x00000002         //DMA2 clock enable
#define RCC_AHBENR_SRAMEN                        0x00000004         //SRAM interface clock enable
#define RCC_AHBENR_FLITFEN                       0x00000010         //FLITF clock enable
#define RCC_AHBENR_CRCEN                         0x00000040         //CRC clock enable
#define RCC_AHBENR_GPIOAEN                       0x00020000         //GPIOA clock enable
#define RCC_AHBENR_GPIOBEN                       0x00040000         //GPIOB clock enable
#define RCC_AHBENR_GPIOCEN                       0x00080000         //GPIOC clock enable
#define RCC_AHBENR_GPIODEN                       0x00100000         //GPIOD clock enable
#define RCC_AHBENR_GPIOEEN                       0x00200000         //GPIOE clock enable
#define RCC_AHBENR_GPIOFEN                       0x00400000         //GPIOF clock enable
#define RCC_AHBENR_TSCEN                         0x01000000         //TS clock enable
#define RCC_AHBENR_ADC12EN                       0x10000000         //ADC1 & ADC2 clock enable
#define RCC_AHBENR_ADC34EN                       0x20000000         //ADC3 & ADC4 clock enable

// Bit definition for RCC_APB2ENR register
#define RCC_APB2ENR_SYSCFGEN                     0x00000001        //SYSCFG clock enable
#define RCC_APB2ENR_TIM1EN                       0x00000800        //TIM1 clock enable
#define RCC_APB2ENR_SPI1EN                       0x00001000        //SPI1 clock enable
#define RCC_APB2ENR_TIM8EN                       0x00002000        //TIM8 clock enable
#define RCC_APB2ENR_USART1EN                     0x00004000        //USART1 clock enable
#define RCC_APB2ENR_TIM15EN                      0x00010000        //TIM15 clock enable
#define RCC_APB2ENR_TIM16EN                      0x00020000        //TIM16 clock enable
#define RCC_APB2ENR_TIM17EN                      0x00040000        //TIM17 clock enable

//Bit definition for RCC_APB1ENR register
#define RCC_APB1ENR_TIM2EN                       0x00000001        //Timer 2 clock enable
#define RCC_APB1ENR_TIM3EN                       0x00000002        //Timer 3 clock enable
#define RCC_APB1ENR_TIM4EN                       0x00000004        //Timer 4 clock enable
#define RCC_APB1ENR_TIM6EN                       0x00000010        //Timer 6 clock enable
#define RCC_APB1ENR_TIM7EN                       0x00000020        //Timer 7 clock enable
#define RCC_APB1ENR_WWDGEN                       0x00000800        //Window Watchdog clock enable
#define RCC_APB1ENR_SPI2EN                       0x00004000        //SPI2 clock enable
#define RCC_APB1ENR_SPI3EN                       0x00008000        //SPI3 clock enable
#define RCC_APB1ENR_USART2EN                     0x00020000        //USART 2 clock enable
#define RCC_APB1ENR_USART3EN                     0x00040000        //USART 3 clock enable
#define RCC_APB1ENR_UART4EN                      0x00080000        //UART 4 clock enable
#define RCC_APB1ENR_UART5EN                      0x00100000        //UART 5 clock enable
#define RCC_APB1ENR_I2C1EN                       0x00200000        //I2C 1 clock enable
#define RCC_APB1ENR_I2C2EN                       0x00400000        //I2C 2 clock enable
#define RCC_APB1ENR_USBEN                        0x00800000        //USB clock enable
#define RCC_APB1ENR_CANEN                        0x02000000        //CAN clock enable
#define RCC_APB1ENR_PWREN                        0x10000000        //PWR clock enable
#define RCC_APB1ENR_DAC1EN                       0x20000000        //DAC 1 clock enable


#define PWR_CR_DBP                           0x00000100              //Disable Backup Domain write protection

