pecostm32/STM32F303_Sine_Square_Generator/STM32F3_Sine_Square_Gen/stm32f303_db.h
//Bit definition for RCC_CSR register
#define RCC_CSR_LSION                        0x00000001              //Internal Low Speed oscillator enable
#define RCC_CSR_LSIRDY                       0x00000002              //Internal Low Speed oscillator Ready
#define RCC_CSR_RMVF                         0x01000000              //Remove reset flag
#define RCC_CSR_PINRSTF                      0x04000000              //PIN reset flag
#define RCC_CSR_PORRSTF                      0x08000000              //POR/PDR reset flag
#define RCC_CSR_SFTRSTF                      0x10000000              //Software Reset flag
#define RCC_CSR_IWDGRSTF                     0x20000000              //Independent Watchdog reset flag
#define RCC_CSR_WWDGRSTF                     0x40000000              //Window watchdog reset flag
#define RCC_CSR_LPWRRSTF                     0x80000000              //Low-Power reset flag

//Bit definition for RCC_BDCR register
#define RCC_BDCR_LSEON                       0x00000001              //External Low Speed oscillator enable
#define RCC_BDCR_LSERDY                      0x00000002              //External Low Speed oscillator Ready
#define RCC_BDCR_LSEBYP                      0x00000004              //External Low Speed oscillator Bypass

//RTC configuration
#define RCC_BDCR_RTCSEL                      0x00000300              //RTCSEL[1:0] bits (RTC clock source selection)
#define RCC_BDCR_RTCSEL_NOCLOCK              0x00000000              //No clock
#define RCC_BDCR_RTCSEL_LSE                  0x00000100              //LSE oscillator clock used as RTC clock
#define RCC_BDCR_RTCSEL_LSI                  0x00000200              //LSI oscillator clock used as RTC clock
#define RCC_BDCR_RTCSEL_HSE                  0x00000300              //HSE oscillator clock divided by 128 used as RTC clock

#define RCC_BDCR_RTCEN                       0x00008000              //RTC clock enable
#define RCC_BDCR_BDRST                       0x00010000              //Backup domain software reset

#define RTC_CRL_RSF                          0x00000008               //Registers Synchronized Flag
#define RTC_CRL_CNF                          0x00000010               //Configuration Flag
#define RTC_CRL_RTOFF                        0x00000020               //RTC operation OFF


#define TIM_CCER_CC1E                        0x00000001               //Capture/Compare 1 output enable
#define TIM_CCER_CC1P                        0x00000002               //Capture/Compare 1 output Polarity

#define TIM_CCER_CC2E                        0x00000010               //Capture/Compare 2 output enable
#define TIM_CCER_CC2P                        0x00000020               //Capture/Compare 2 output Polarity

#define TIM_CCER_CC3E                        0x00000100               //Capture/Compare 3 output enable
#define TIM_CCER_CC3P                        0x00000200               //Capture/Compare 3 output Polarity

#define TIM_CCER_CC4E                        0x00001000               //Capture/Compare 4 output enable
#define TIM_CCER_CC4P                        0x00002000               //Capture/Compare 4 output Polarity


#define TIM_CR2_MMS                          0x00000070               //MMS[2:0] bits (Master Mode Selection)
#define TIM_CR2_MMS_0                        0x00000010
#define TIM_CR2_MMS_1                        0x00000020
#define TIM_CR2_MMS_2                        0x00000040

#define TIM_CR1_CEN                          0x00000001                //Counter enable

#define TIM_CR1_ARPE                         0x00000080                //Auto-reload preload enable

#define TIM_CR1_CMS                          0x00000060                //CMS[1:0] bits (Center-aligned mode selection)
#define TIM_CR1_CMS_0                        0x00000020
#define TIM_CR1_CMS_1                        0x00000040



#define TIM_SMCR_SMS                         0x00010007                //SMS[2:0] bits (Slave mode selection)
#define TIM_SMCR_SMS_0                       0x00000001
#define TIM_SMCR_SMS_1                       0x00000002
#define TIM_SMCR_SMS_2                       0x00000004
#define TIM_SMCR_SMS_3                       0x00010000

#define TIM_CCMR1_OC1PE                      0x00000008               //Output Compare 1 Preload enable

#define TIM_CCMR1_OC1M                       0x00010070                //OC1M[2:0] bits (Output Compare 1 Mode)
#define TIM_CCMR1_OC1M_0                     0x00000010
#define TIM_CCMR1_OC1M_1                     0x00000020
#define TIM_CCMR1_OC1M_2                     0x00000040
#define TIM_CCMR1_OC1M_3                     0x00010000


#define TIM_CCMR1_OC2M                       0x01007000                //OC2M[2:0] bits (Output Compare 2 Mode)
#define TIM_CCMR1_OC2M_0                     0x00001000
#define TIM_CCMR1_OC2M_1                     0x00002000
#define TIM_CCMR1_OC2M_2                     0x00004000
#define TIM_CCMR1_OC2M_3                     0x01000000


#define TIM_CCMR2_OC3M                       0x00010070                //OC1M[2:0] bits (Output Compare 3 Mode)
#define TIM_CCMR2_OC3M_0                     0x00000010
#define TIM_CCMR2_OC3M_1                     0x00000020
#define TIM_CCMR2_OC3M_2                     0x00000040
#define TIM_CCMR2_OC3M_3                     0x00010000


#define TIM_CCMR2_OC4M                       0x01007000                //OC2M[2:0] bits (Output Compare 4 Mode)
#define TIM_CCMR2_OC4M_0                     0x00001000
#define TIM_CCMR2_OC4M_1                     0x00002000
#define TIM_CCMR2_OC4M_2                     0x00004000
#define TIM_CCMR2_OC4M_3                     0x01000000


#define TIM_BDTR_MOE                         0x00008000                //Main Output enable

#define TIM_DIER_UIE                         0x00000001                //Update interrupt enable

#define TIM_DIER_UDE                         0x00000100                //Update DMA request enable

#define TIM_DIER_CC1IE                       0x00000002                //Capture/Compare 1 interrupt enable


#define TIM_SR_CC1IF                         0x00000002                //Capture/Compare 1 interrupt Flag


#define AFIO_MAPR_TIM3_REMAP_1               0x00000800                //Timer3 pins on alternate function pins

