pecostm32/STM32F303_Sine_Square_Generator/STM32F3_Sine_Square_Gen/stm32f303_db.h
#define AFIO_MAPR_SWJ_CFG_JTAGDISABLE        0x02000000                //JTAG-DP Disabled and SW-DP Enabled


#define AIRCR_VECTKEY_MASK      ((uint32_t)0x05FA0000)

#define EXTI_Line18             ((uint32_t)0x40000)  //External interrupt line 18 Connected to the USB Device/USB OTG FS

#define NVIC_PriorityGroup_2    ((uint32_t)0x500)    //2 bits for pre-emption priority, 2 bits for subpriority

#define STK_CTRL_ENABLE       0x00000001               //Enable the system timer
#define STK_CTRL_INT_ENABLE   0x00000002               //Enable the system timer interrupt
#define STK_CTRL_CLK_CPU      0x00000004               //Select the cpu clock as system timer input clock
#define STK_CTRL_OVERFLOW     0x00010000               //Overflow flag


#define USB_CNTR_SOFM                           0x00000200              //Start Of Frame Interrupt Mask
#define USB_CNTR_RESETM                         0x00000400              //RESET Interrupt Mask
#define USB_CNTR_SUSPM                          0x00000800              //Suspend mode Interrupt Mask
#define USB_CNTR_CTRM                           0x00008000              //Correct Transfer Interrupt Mask

#define USB_EP_TX_VALID                         0x00000030              //EndPoint TX VALID
#define USB_EP_TX_NAK                           0x00000020              //EndPoint TX NAKed

#define USB_EP_CTR_RX                           0x00008000              //EndPoint Correct TRansfer RX
#define USB_EPRX_STAT                           0x00003000              //EndPoint RX STATus bit field
#define USB_EP_SETUP                            0x00000800              //EndPoint SETUP
#define USB_EP_T_FIELD                          0x00000600              //EndPoint TYPE
#define USB_EP_KIND                             0x00000100              //EndPoint KIND
#define USB_EP_CTR_TX                           0x00000080              //EndPoint Correct TRansfer TX
#define USB_EPTX_STAT                           0x00000030              //EndPoint TX STATus bit field
#define USB_EPADDR_FIELD                        0x0000000F              //EndPoint ADDRess FIELD

#define  USB_EPREG_MASK                      (USB_EP_CTR_RX | USB_EP_SETUP | USB_EP_T_FIELD | USB_EP_KIND | USB_EP_CTR_TX | USB_EPADDR_FIELD)

#define USB_ISTR_EP_ID                          0x0000000F               //Endpoint Identifier
#define USB_ISTR_ESOF                           0x00000100               //Expected Start Of Frame
#define USB_ISTR_SOF                            0x00000200               //Start Of Frame
#define USB_ISTR_RESET                          0x00000400               //USB RESET request
#define USB_ISTR_SUSP                           0x00000800               //Suspend mode request
#define USB_ISTR_WKUP                           0x00001000               //Wake up
#define USB_ISTR_ERR                            0x00002000               //Error
#define USB_ISTR_PMAOVR                         0x00004000               //Packet Memory Area Over / Underrun
#define USB_ISTR_CTR                            0x00008000               //Correct Transfer

#define USB_EP_BULK                             0x00000000               //EndPoint BULK
#define USB_EP_CONTROL                          0x00000200               //EndPoint CONTROL
#define USB_EP_INTERRUPT                        0x00000600               //EndPoint INTERRUPT

#define USB_EP_RX_DIS                           0x00000000               //EndPoint RX DISabled
#define USB_EP_RX_VALID                         0x00003000               //EndPoint RX VALID

#define USB_DADDR_EF                            0x00000080               //Enable Function






//Bit definition for DAC_CR register
#define DAC_CR_EN1                  0x00000001                            //DAC channel1 enable
#define DAC_CR_BOFF1                0x00000002                            //DAC channel1 output buffer disable
#define DAC_CR_TEN1                 0x00000004                            //DAC channel1 Trigger enable

#define DAC_CR_TSEL1                0x00000038                            //TSEL1[2:0] (DAC channel1 Trigger selection)
#define DAC_CR_TSEL1_0              0x00000008
#define DAC_CR_TSEL1_1              0x00000010
#define DAC_CR_TSEL1_2              0x00000020

#define DAC_CR_TSEL1_SOFTWARE       0x00000038


#define DAC_CR_WAVE1                0x000000C0                            //WAVE1[1:0] (DAC channel1 noise/triangle wave generation enable)
#define DAC_CR_WAVE1_0              0x00000040
#define DAC_CR_WAVE1_1              0x00000080

#define DAC_CR_MAMP1                0x00000F00                            //MAMP1[3:0] (DAC channel1 Mask/Amplitude selector)
#define DAC_CR_MAMP1_0              0x00000100
#define DAC_CR_MAMP1_1              0x00000200
#define DAC_CR_MAMP1_2              0x00000400
#define DAC_CR_MAMP1_3              0x00000800

#define DAC_CR_DMAEN1               0x00001000                            //DAC channel1 DMA enable
#define DAC_CR_DMAUDRIE1            0x00002000                            //DAC channel1 DMA underrun IT enable 
#define DAC_CR_EN2                  0x00010000                            //DAC channel2 enable
#define DAC_CR_BOFF2                0x00020000                            //DAC channel2 output buffer disable
#define DAC_CR_TEN2                 0x00040000                            //DAC channel2 Trigger enable

#define DAC_CR_TSEL2                0x00380000                            //TSEL2[2:0] (DAC channel2 Trigger selection)
#define DAC_CR_TSEL2_0              0x00080000
#define DAC_CR_TSEL2_1              0x00100000
#define DAC_CR_TSEL2_2              0x00200000

#define DAC_CR_WAVE2                0x00C00000                            //WAVE2[1:0] (DAC channel2 noise/triangle wave generation enable)
#define DAC_CR_WAVE2_0              0x00400000
#define DAC_CR_WAVE2_1              0x00800000

#define DAC_CR_MAMP2                0x0F000000                            //MAMP2[3:0] (DAC channel2 Mask/Amplitude selector)
#define DAC_CR_MAMP2_0              0x01000000
#define DAC_CR_MAMP2_1              0x02000000
#define DAC_CR_MAMP2_2              0x04000000
#define DAC_CR_MAMP2_3              0x08000000

#define DAC_CR_DMAEN2               0x10000000                            //DAC channel2 DMA enabled
#define DAC_CR_DMAUDRIE2            0x20000000                            //DAC channel2 DMA underrun IT enable 

//Bit definition for DAC_SWTRIGR register
#define DAC_SWTRIGR_SWTRIG1         0x00000001                            //DAC channel1 software trigger
#define DAC_SWTRIGR_SWTRIG2         0x00000002                            //DAC channel2 software trigger

//Bit definition for DAC_DHR12R1 register
#define DAC_DHR12R1_DACC1DHR        0x00000FFF                            //DAC channel1 12-bit Right aligned data

