pecostm32/STM32F303_Sine_Square_Generator/STM32F3_Sine_Square_Gen/stm32f303_db.h
//Bit definition for DAC_DHR12L1 register
#define DAC_DHR12L1_DACC1DHR        0x0000FFF0                            //DAC channel1 12-bit Left aligned data

//Bit definition for DAC_DHR8R1 register
#define DAC_DHR8R1_DACC1DHR         0x000000FF                            //DAC channel1 8-bit Right aligned data

//Bit definition for DAC_DHR12R2 register
#define DAC_DHR12R2_DACC2DHR        0x00000FFF                            //DAC channel2 12-bit Right aligned data

//Bit definition for DAC_DHR12L2 register
#define DAC_DHR12L2_DACC2DHR        0x0000FFF0                            //DAC channel2 12-bit Left aligned data

//Bit definition for DAC_DHR8R2 register
#define DAC_DHR8R2_DACC2DHR         0x000000FF                            //DAC channel2 8-bit Right aligned data

//Bit definition for DAC_DHR12RD register
#define DAC_DHR12RD_DACC1DHR        0x00000FFF                            //DAC channel1 12-bit Right aligned data
#define DAC_DHR12RD_DACC2DHR        0x0FFF0000                            //DAC channel2 12-bit Right aligned data

//Bit definition for DAC_DHR12LD register
#define DAC_DHR12LD_DACC1DHR        0x0000FFF0                            //DAC channel1 12-bit Left aligned data
#define DAC_DHR12LD_DACC2DHR        0xFFF00000                            //DAC channel2 12-bit Left aligned data

//Bit definition for DAC_DHR8RD register
#define DAC_DHR8RD_DACC1DHR         0x000000FF                            //DAC channel1 8-bit Right aligned data
#define DAC_DHR8RD_DACC2DHR         0x0000FF00                            //DAC channel2 8-bit Right aligned data

//Bit definition for DAC_DOR1 register
#define DAC_DOR1_DACC1DOR           0x00000FFF                            //DAC channel1 data output

//Bit definition for DAC_DOR2 register
#define DAC_DOR2_DACC2DOR           0x00000FFF                            //DAC channel2 data output

//Bit definition for DAC_SR register
#define DAC_SR_DMAUDR1              0x00002000                            //DAC channel1 DMA underrun flag
#define DAC_SR_DMAUDR2              0x20000000                            //DAC channel2 DMA underrun flag

//ADC defines

#define ADC_ISR_ADRDY               0x00000001                            //ADC ready flag



#define ADC_CR_ADEN                 0x00000001                            //ADC enable

#define ADC_CR_ADCAL                0x80000000                            //ADC calibration

#define ADC_CR_ADVREG_INTERMEDIATE  0x00000000                            //Set ADC voltage regulator to intermediate state
#define ADC_CR_ADVREG_ON            0x10000000                            //Set ADC voltage regulator to on state
#define ADC_CR_ADVREG_OFF           0x20000000                            //Set ADC voltage regulator to off state

#define ADC_SQR1_SQ1_POS            6                                     //Position of lsb for first serquence channel selector
#define ADC_SQR1_SQ1_MSK            0x000007C0                            //Bit mask for first serquence channel selector


//Sample times are in adc clock cycles plus one half cycle. (So ADC_SAMPLE_TIME_7 means 7.5 adc clock cycles)
#define ADC_SAMPLE_TIME_1           0
#define ADC_SAMPLE_TIME_2           1
#define ADC_SAMPLE_TIME_4           2
#define ADC_SAMPLE_TIME_7           3
#define ADC_SAMPLE_TIME_19          4
#define ADC_SAMPLE_TIME_61          5
#define ADC_SAMPLE_TIME_181         6
#define ADC_SAMPLE_TIME_601         7

#define ADC_SMPR1_CH3_POS           9                                     //Position of lsb for third channel sample time setting
#define ADC_SMPR1_CH3_MSK           0x00000E00                            //Bit mask for third channel sample time setting


#define ADC_CCR_CKMODE_ASYNC        0x00000000                            //Asynchronous clock mode
#define ADC_CCR_CKMODE_HCLK_1       0x00010000                            //Synchronous clock mode, HCLK / 1
#define ADC_CCR_CKMODE_HCLK_2       0x00020000                            //Synchronous clock mode, HCLK / 2
#define ADC_CCR_CKMODE_HCLK_4       0x00030000                            //Synchronous clock mode, HCLK / 4

#define ADC_CCR_MDMA_OFF            0x00000000                            //DMA in dual mode disabled
#define ADC_CCR_MDMA_10_12_BIT      0x00008000                            //DMA in dual mode set for 10 or 12 bits
#define ADC_CCR_MDMA_6_8_BIT        0x0000C000                            //DMA in dual mode set for 6 or 8 bits

#define ADC_CCR_DMACFG_CIRCULAIR    0x00002000                            //DMA in circulair mode

#define ADC_CCR_MULTI_RS            0x00000006                            //Multi mode regulair simultaneous only


//DMA definitions
#define DMA_CCR_EN                  0x00000001                            //Channel enable
#define DMA_CCR_TCIE                0x00000002                            //Transfer complete interrupt enable
#define DMA_CCR_HTIE                0x00000004                            //Half Transfer interrupt enable
#define DMA_CCR_TEIE                0x00000008                            //Transfer error interrupt enable
#define DMA_CCR_DIR                 0x00000010                            //Data transfer direction
#define DMA_CCR_CIRC                0x00000020                            //Circular mode
#define DMA_CCR_PINC                0x00000040                            //Peripheral increment mode
#define DMA_CCR_MINC                0x00000080                            //Memory increment mode

#define DMA_CCR_PSIZE               0x00000300                            //PSIZE[1:0] bits (Peripheral size)
#define DMA_CCR_PSIZE_0             0x00000100
#define DMA_CCR_PSIZE_1             0x00000200

#define DMA_CCR_MSIZE               0x00000C00                            //MSIZE[1:0] bits (Memory size)
#define DMA_CCR_MSIZE_0             0x00000400
#define DMA_CCR_MSIZE_1             0x00000800

#define DMA_CCR_PL                  0x00003000                            //PL[1:0] bits(Channel Priority level)
#define DMA_CCR_PL_0                0x00001000
#define DMA_CCR_PL_1                0x00002000

#define DMA_CCR_MEM2MEM             0x00004000                            //Memory to memory mode




//Bitmap for the gpio settings
//Bit 0:1   Mode
//Bit 4     Output type
//Bit 8:9   Output speed
//Bit 12:13 Pull-up pull-down settings

#define GPIO_MODE_MASK                    0x00000003
#define GPIO_TYPE_MASK                    0x00000010
#define GPIO_SPEED_MASK                   0x00000300
#define GPIO_PUPD_MASK                    0x00003000

