pecostm32/STM32F303_Sine_Square_Generator/STM32F3_Sine_Square_Gen/stm32f303_db.h
//General purpose output options
//Push pull
#define GPIO_OUTPUT_PP_LOW_SPEED          0x00000001
#define GPIO_OUTPUT_PP_MEDIUM_SPEED       0x00000101
#define GPIO_OUTPUT_PP_HIGH_SPEED         0x00000301

//Push pull with pull up
#define GPIO_OUTPUT_PP_PU_LOW_SPEED       0x00001001
#define GPIO_OUTPUT_PP_PU_MEDIUM_SPEED    0x00001101
#define GPIO_OUTPUT_PP_PU_HIGH_SPEED      0x00001301

//Push pull with pull down
#define GPIO_OUTPUT_PP_PD_LOW_SPEED       0x00002001
#define GPIO_OUTPUT_PP_PD_MEDIUM_SPEED    0x00002101
#define GPIO_OUTPUT_PP_PD_HIGH_SPEED      0x00002301

//Open drain
#define GPIO_OUTPUT_OD_LOW_SPEED          0x00000011
#define GPIO_OUTPUT_OD_MEDIUM_SPEED       0x00000111
#define GPIO_OUTPUT_OD_HIGH_SPEED         0x00000311

//Open drain with pull up
#define GPIO_OUTPUT_OD_PU_LOW_SPEED       0x00001011
#define GPIO_OUTPUT_OD_PU_MEDIUM_SPEED    0x00001111
#define GPIO_OUTPUT_OD_PU_HIGH_SPEED      0x00001311

//Open drain with pull down
#define GPIO_OUTPUT_OD_PD_LOW_SPEED       0x00002011
#define GPIO_OUTPUT_OD_PD_MEDIUM_SPEED    0x00002111
#define GPIO_OUTPUT_OD_PD_HIGH_SPEED      0x00002311

//Alternate function options
//Push pull
#define GPIO_AF_PP_LOW_SPEED              0x00000002
#define GPIO_AF_PP_MEDIUM_SPEED           0x00000102
#define GPIO_AF_PP_HIGH_SPEED             0x00000302

//Push pull with pull up
#define GPIO_AF_PP_PU_LOW_SPEED           0x00001002
#define GPIO_AF_PP_PU_MEDIUM_SPEED        0x00001102
#define GPIO_AF_PP_PU_HIGH_SPEED          0x00001302

//Push pull with pull down
#define GPIO_AF_PP_PD_LOW_SPEED           0x00002002
#define GPIO_AF_PP_PD_MEDIUM_SPEED        0x00002102
#define GPIO_AF_PP_PD_HIGH_SPEED          0x00002302

//Open drain
#define GPIO_AF_OD_LOW_SPEED              0x00000012
#define GPIO_AF_OD_MEDIUM_SPEED           0x00000112
#define GPIO_AF_OD_HIGH_SPEED             0x00000312

//Open drain with pull up
#define GPIO_AF_OD_PU_LOW_SPEED           0x00001012
#define GPIO_AF_OD_PU_MEDIUM_SPEED        0x00001112
#define GPIO_AF_OD_PU_HIGH_SPEED          0x00001312

//Open drain with pull down
#define GPIO_AF_OD_PD_LOW_SPEED           0x00002012
#define GPIO_AF_OD_PD_MEDIUM_SPEED        0x00002112
#define GPIO_AF_OD_PD_HIGH_SPEED          0x00002312

//General purpose input options
#define GPIO_INPUT_FLOAT                  0x00000000
#define GPIO_INPUT_PULLUP                 0x00001000
#define GPIO_INPUT_PULLDOWN               0x00002000

//Analog option
#define GPIO_ANALOG                       0x00000003


#endif


